In [16]:
import seaborn as sns

In [22]:
df = sns.load_dataset('titanic')

In [23]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [25]:
df = df[['sex', 'embarked','pclass','alone','survived']]
df.head()

      sex embarked  pclass  alone  survived
0    male        S       3  False         0
1  female        C       1  False         1
2  female        S       3   True         1
3  female        S       1  False         1
4    male        S       3   True         0

In [26]:
df['sex']=np.where(df['sex']=='male',1,0)

In [27]:
df.head()

   sex embarked  pclass  alone  survived
0    1        S       3  False         0
1    0        C       1  False         1
2    0        S       3   True         1
3    0        S       1  False         1
4    1        S       3   True         0

In [29]:
ordinal_label = {k: i for i, k in enumerate(df['embarked'].unique(), 0)}
df['embarked'] = df['embarked'].map(ordinal_label)

In [30]:
df.head()

   sex  embarked  pclass  alone  survived
0    1         0       3  False         0
1    0         1       1  False         1
2    0         0       3   True         1
3    0         0       1  False         1
4    1         0       3   True         0

In [31]:
df['alone']=np.where(df['alone']==True,1,0)
df.head()

   sex  embarked  pclass  alone  survived
0    1         0       3      0         0
1    0         1       1      0         1
2    0         0       3      1         1
3    0         0       1      0         1
4    1         0       3      1         0

In [32]:
from sklearn.model_selection import train_test_split

In [45]:
X_train, X_test, y_train, y_test = train_test_split(df[['sex','embarked','alone','pclass']],
                                              df['survived'],test_size=0.3, random_state=42)

In [39]:
X_train.head()

     sex  embarked  alone  pclass
69     1         0      0       3
85     0         0      0       3
794    1         0      1       3
161    0         0      1       2
815    1         0      1       1

In [35]:
from sklearn.feature_selection import chi2

In [46]:
f_p_values=chi2(X_train,y_train)

In [47]:
f_p_values

(array([60.41964418, 11.363384  ,  8.35778435, 17.40807208]),
 array([7.66442567e-15, 7.49062219e-04, 3.84038546e-03, 3.01542662e-05]))

In [48]:
import pandas as pd
p_values=pd.Series(f_p_values[1])
p_values.index=X_train.columns
p_values

sex         7.664426e-15
embarked    7.490622e-04
alone       3.840385e-03
pclass      3.015427e-05
dtype: float64

In [49]:
p_values.sort_index(ascending=False)

sex         7.664426e-15
pclass      3.015427e-05
embarked    7.490622e-04
alone       3.840385e-03
dtype: float64

In [ ]:
# sex column is the most important column when compared to other features